# ConditionCount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationServiceButton..::..ConditionCount Property
FabricationServiceButton Class See Also
---
The number of conditions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public int ConditionCount { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ConditionCount As Integer
	Get
```

Visual C++
---
```text
public:
property int ConditionCount {
	int get ();
}
```

# See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace